# =====================================================
# USER STATE STORAGE
# =====================================================


# текущий шаг создания анкеты
user_step = {}



# временные данные пользователя
# пока он заполняет анкету
user_data = {}



# =====================================================
# RESET USER
# =====================================================


def reset_user(
    user_id: int
):

    if user_id in user_step:

        del user_step[user_id]


    if user_id in user_data:

        del user_data[user_id]